In [7]:
# On imagine une prime de 10% pour tout le monde
df['Salaire_avec_Prime'] = df['Salaire'] * 1.10
df

      Nom           Poste  Salaire  Expérience  Salaire_avec_Prime
0    Adam  Data Scientist    45000           2             49500.0
1   Sarah             CEO    80000          10             88000.0
2   Karim    Data Analyst    38000           1             41800.0
3   Julie        Dev Java    42000           3             46200.0
4  Thomas       Stagiaire    15000           0             16500.0

In [6]:
# Étape 1 : La condition (Ça répond True ou False)
condition = df['Salaire'] > 40000

# Étape 2 : Le filtre
riches = df[condition]
riches

# Version pro (en une ligne) :
# "Montre-moi le DF où le salaire est > 40000"
df[df['Salaire'] > 40000]

     Nom           Poste  Salaire  Expérience
0   Adam  Data Scientist    45000           2
1  Sarah             CEO    80000          10
3  Julie        Dev Java    42000           3

In [5]:
# Récupérer juste la colonne des Salaires
salaires = df['Salaire']
salaires

# Récupérer plusieurs colonnes
infos_pros = df[['Nom', 'Poste']] # Note les doubles crochets [[ ]]
infos_pros

      Nom           Poste
0    Adam  Data Scientist
1   Sarah             CEO
2   Karim    Data Analyst
3   Julie        Dev Java
4  Thomas       Stagiaire

In [4]:
# Voir les 3 premières lignes (très utile quand tu as 1 million de lignes)
df.head(3)

# Avoir le résumé technique (Y a-t-il des trous ? C'est des chiffres ou du texte ?)
df.info()

# Avoir les statistiques automatiques (Moyenne, max, min...)
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Nom         5 non-null      object
 1   Poste       5 non-null      object
 2   Salaire     5 non-null      int64
 3   Expérience  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

            Salaire  Expérience
count      5.000000    5.000000
mean   44000.000000    3.200000
std    23334.523779    3.962323
min    15000.000000    0.000000
25%    38000.000000    1.000000
50%    42000.000000    2.000000
75%    45000.000000    3.000000
max    80000.000000   10.000000

In [1]:
import pandas as pd

# On crée des données fictives (un dictionnaire)
data = {
    'Nom': ['Adam', 'Sarah', 'Karim', 'Julie', 'Thomas'],
    'Poste': ['Data Scientist', 'CEO', 'Data Analyst', 'Dev Java', 'Stagiaire'],
    'Salaire': [45000, 80000, 38000, 42000, 15000],
    'Expérience': [2, 10, 1, 3, 0]
}

# On transforme ça en DataFrame (Tableau Pandas)
df = pd.DataFrame(data)

# On affiche le tableau
df  # Dans un notebook, pas besoin de print(), juste taper le nom de la variable suffit

      Nom           Poste  Salaire  Expérience
0    Adam  Data Scientist    45000           2
1   Sarah             CEO    80000          10
2   Karim    Data Analyst    38000           1
3   Julie        Dev Java    42000           3
4  Thomas       Stagiaire    15000           0